<h1 style="font-family:'Glacial Indifference', sans-serif; font-size:32px; text-align:center; background-color:teal; color:white; border-radius: 15px 50px; ">TOP SQL 50 </h1>

> This notebook gathers my own solution for 50 SQL interviews questions on Leetcode. A full list of these questions are accessible [here](https://leetcode.com/studyplan/top-sql-50/).
> 
> The dialect I used for these challenges is MySQL. For each problem, its hyperlink and corresponding LeetCode number and name are provided at the beginning."

# SECTION 1: SELECT

## Problem 1

*[(1757. Recyclable and Low Fat Products)](https://leetcode.com/problems/recyclable-and-low-fat-products/description/)*

### Problem statement

Table `Products`

| Column Name | Type    |
|-------------|---------|
| product_id  | int     |
| low_fats    | enum    |
| recyclable  | enum    |

`product_id` is the primary key (column with unique values) for this table.  
`low_fats` is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.   
`recyclable` is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

Write a solution to **find the ids of products that are both low fat and recyclable.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1**

**Input:**

`Products` table:
| product_id  | low_fats | recyclable |
|-------------|----------|------------|
| 0           | Y        | N          |
| 1           | Y        | Y          |
| 2           | N        | Y          |
| 3           | Y        | Y          |
| 4           | N        | N          |

**Output:**  
| product_id  |
|-------------|
| 1           |
| 3           |

**Explanation:** Only products 1 and 3 are both low fat and recyclable.

### Solution

SELECT product_id
FROM Products
WHERE low_fats = 'y' AND recyclable = 'y';

## Problem 2

*[(584. Find Customer Referee)](https://leetcode.com/problems/find-customer-referee/description/)*

### Problem statement

Table: `Customer`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| referee_id  | int     |

`id` is the primary key column for this table.  
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.

Find the **names of the customers that are not referred by the customer with** `id = 2`.

Return the result table in **any order.**

The result format is as follows:

**Example 2**

**Input:**

`Customer` table:

| id | name | referee_id |
|----|------|------------|
| 1  | Will | null       |
| 2  | Jane | null       |
| 3  | Alex | 2          |
| 4  | Bill | null       |
| 5  | Zack | 1          |
| 6  | Mark | 2          |

**Output:**

| name |
|------|
| Will |
| Jane |
| Bill |
| Zack |

### Solution

In [ ]:
SELECT name
FROM Customer
WHERE referee_id <> 2 OR referee_id IS NULL;

## Problem 3

*[(595. Big Countries)](https://leetcode.com/problems/big-countries/description)*

### Problem statement

Table: `World`

| Column Name | Type    |
|-------------|---------|
| name        | varchar |
| continent   | varchar |
| area        | int     |
| population  | int     |
| gdp         | bigint  |

`name` is the primary key (column with unique values) for this table.  
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.

A country is considered big if:
- it has an area of at least three million (i.e., 3000000 kmÂ²), or
- it has a population of at least twenty-five million (i.e., 25000000).

Write a solution to **find the name, population, and area of the big countries.**

Return the result table in **any** order.

**Example:**

**Input:**

`World` table:
| name        | continent | area    | population | gdp          |
|-------------|-----------|---------|------------|--------------|
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |

**Output:**
| name        | population | area    |
|-------------|------------|---------|
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |

### Solution

In [ ]:
SELECT name, population, area
FROM World
WHERE area >= 3000000 OR population >= 25000000;

## Problem 4

*[(1148. Article Views I)](https://leetcode.com/problems/article-views-i/description)*

### Problem statement

Table: `Views`

| Column Name | Type    |
|-------------|---------|
| article_id  | int     |
| author_id   | int     |
| viewer_id   | int     |
| view_date   | date    |

Each row of this table indicates that some viewer viewed an article (written by some author) on some date. Note that equal `author_id` and `viewer_id` indicate the same person.

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by `id` in ascending order.

**Example:**

**Input:**  

`Views` table:
| article_id | author_id | viewer_id | view_date  |
|------------|-----------|-----------|------------|
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

**Output:**  
| id   |
|------|
| 4    |
| 7    |

### Solution

In [ ]:
SELECT author_id AS id
FROM Views
WHERE Views.author_id = Views.viewer_id
GROUP BY id
ORDER BY id

## Problem 5

### Problem statement

*[(1683. Invalid Tweets)](https://leetcode.com/problems/invalid-tweets/description)*

Table: `Tweets`

| Column Name | Type    |
|-------------|---------|
| tweet_id    | int     |
| content     | varchar |

`tweet_id` is the primary key (column with unique values) for this table. This table contains all the tweets in a social media app.
The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Write a solution to **find the IDs of the invalid tweets.** 

Return the result table in any order.

**Example 1:**

**Input:**  

`Tweets` table:
| tweet_id | content                          |
|----------|----------------------------------|
| 1        | Vote for Biden                   |
| 2        | Let us make America great again! |

**Output:**  
| tweet_id |
|----------|
| 2        |

**Explanation:**  
Tweet 1 has length = 14. It is a valid tweet.  
Tweet 2 has length = 32. It is an invalid tweet.

### Solution

In [ ]:
SELECT tweet_id
FROM Tweets
WHERE length(content) > 15

---

# SECTION 2: BASIC JOINS

## Problem 6

### Problem statement

*[(1378. Replace Employee ID With The Unique Identifier)](https://leetcode.com/problems/https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description)*

Table: `Employees`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |

`id` is the primary key (column with unique values) for this table.  
Each row of this table contains the id and the name of an employee in a company.

Table: `EmployeeUNI`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| unique_id   | int     |

`(id, unique_id)` is the primary key (combination of columns with unique values) for this table.  
Each row of this table contains the id and the corresponding unique id of an employee in the company.

Write a solution to **show the** unique ID **of each user**. If a user does not have a unique ID, replace it with `null`.

Return the result table in **any order.**

**Example 1:**

**Input:**  

`Employees` table:
| id | name     |
|----|----------|
| 1  | Alice    |
| 7  | Bob      |
| 11 | Meir     |
| 90 | Winston  |
| 3  | Jonathan |

`EmployeeUNI` table:
| id | unique_id |
|----|-----------|
| 3  | 1         |
| 11 | 2         |
| 90 | 3         |

**Output:**  
| unique_id | name     |
|-----------|----------|
| null      | Alice    |
| null      | Bob      |
| 2         | Meir     |
| 3         | Winston  |
| 1         | Jonathan |

**Explanation:**  
Alice and Bob do not have a unique ID, so we show null instead.  
The unique ID of Meir is 2.  
The unique ID of Winston is 3.  
The unique ID of Jonathan is 1.

### Solution

In [ ]:
SELECT e_id.unique_id, e_name.name
FROM EmployeeUNI AS e_id
RIGHT JOIN Employees AS e_name
ON e_id.id = e_name.id

## Problem 7

*[(1068. Product Sales Analysis I)](https://leetcode.com/problems/product-sales-analysis-i/description)*

### Problem statement

Table: `Sales`

| Column Name | Type  |
|-------------|-------|
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |

`(sale_id, year)` is the primary key (combination of columns with unique values) of this table.  
`product_id` is a foreign key (reference column) to `Product` table.  
Each row of this table shows a sale on the product `product_id` in a certain year. Note that the price is per unit.

Table: `Product`

| Column Name  | Type    |
|--------------|---------|
| product_id   | int     |
| product_name | varchar |

`product_id` is the primary key (column with unique values) of this table.  
Each row of this table indicates the product name of each product.

Write a solution to **report the** `product_name`, `year`**, and** `price` **for each** `sale_id` **in the** `Sales` **table.**

Return the resulting table in **any order**.

**Example 1:**

**Input:**  

`Sales` table:
| sale_id | product_id | year | quantity | price |
|---------|------------|------|----------|-------| 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

`Product` table:
| product_id | product_name |
|------------|--------------|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

**Output:**  
| product_name | year  | price |
|--------------|-------|-------|
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |

**Explanation:**  
- From sale_id = 1, we can conclude that Nokia was sold for 5000 in the year 2008.
- From sale_id = 2, we can conclude that Nokia was sold for 5000 in the year 2009.
- From sale_id = 7, we can conclude that Apple was sold for 9000 in the year 2011.

### Solution

In [ ]:
SELECT Product.product_name, Sales.year, Sales.price
FROM Sales
LEFT JOIN Product
ON Sales.product_id = Product.product_id

## Problem 8

*[(1581. Customer Who Visited but Did Not Make Any Transactions)](https://leetcode.com/problems/customer-who-visited-but-did-not-make-any-transactions/)*

### Problem statement

Table: `Visits`

| Column Name | Type    |
|-------------|---------|
| visit_id    | int     |
| customer_id | int     |

`visit_id` is the column with unique values for this table. This table contains information about the customers who visited the mall.

Table: `Transactions`

| Column Name    | Type    |
|----------------|---------|
| transaction_id | int     |
| visit_id       | int     |
| amount         | int     |

`transaction_id` is column with unique values for this table. This table contains information about the transactions made during the `visit_id`.

Write a solution to **find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.**

Return the result table sorted in **any order**.

**Example 1:**

**Input:**  

`Visits` table
| visit_id | customer_id |
|----------|-------------|
| 1        | 23          |
| 2        | 9           |
| 4        | 30          |
| 5        | 54          |
| 6        | 96          |
| 7        | 54          |
| 8        | 54          |

`Transactions` table
| transaction_id | visit_id | amount |
|----------------|----------|--------|
| 2              | 5        | 310    |
| 3              | 5        | 300    |
| 9              | 5        | 200    |
| 12             | 1        | 910    |
| 13             | 2        | 970    |

**Output:**  
| customer_id | count_no_trans |
|-------------|----------------|
| 54          | 2              |
| 30          | 1              |
| 96          | 1              |

**Explanation:**  
- Customer with id = 23 visited the mall once and made one transaction during the visit with id = 12.  
- Customer with id = 9 visited the mall once and made one transaction during the visit with id = 13.  
- Customer with id = 30 visited the mall once and did not make any transactions.  
- Customer with id = 54 visited the mall three times. During 2 visits they did not make any transactions, and during one visit they made 3 transactions.  
- Customer with id = 96 visited the mall once and did not make any transactions.
  
As we can see, users with IDs 30 and 96 visited the mall one time without making any transactions. Also, user 54 visited the mall twice and did not make any transactions.

### Solution

In [ ]:
SELECT Visits.customer_id, COUNT(*) as count_no_trans
FROM Visits
LEFT JOIN Transactions
ON Visits.visit_id = Transactions.visit_id
WHERE transaction_id IS NULL
GROUP BY Visits.customer_id

## Problem 9

### Problem statement

*[(197. Rising Temperature)](https://leetcode.com/problems/rising-temperature/)*

Table: `Weather`

| Column Name | Type  |
|-------------|-------|
| id          | int   |
| recordDate  | date  |
| temperature | int   |

`id` is the column with unique values for this table. There are no different rows with the same `recordDate`. This table contains information about the temperature on a certain day.

Write a solution to *find all dates' `Id` with higher temperatures compared to its previous dates (yesterday).*

Return the result table in **any order**.

**Example 1:**

**Input:**  

`Weather` table:
| id | recordDate | temperature |
|----|------------|-------------|
| 1  | 2015-01-01 | 10          |
| 2  | 2015-01-02 | 25          |
| 3  | 2015-01-03 | 20          |
| 4  | 2015-01-04 | 30          |

**Output:**  
| id |
|----|
| 2  |
| 4  |

**Explanation:**  
- In 2015-01-02, the temperature was higher than the previous day (10 -> 25).  
- In 2015-01-04, the temperature was higher than the previous day (20 -> 30).

### Solution

**Idea**: Using a subquery to compute the lagged temperature and date using the LAG() window function ordered by recordDate, and then filters the results based on the specified conditions.

In [ ]:
SELECT id
FROM (
    SELECT 
        id,
        temperature,
        recordDate,
        LAG(temperature) OVER (ORDER BY recordDate) AS prev_temperature,
        LAG(recordDate) OVER (ORDER BY recordDate) AS prev_recordDate
    FROM Weather
) AS weather_with_lag
WHERE temperature > prev_temperature
  AND DATEDIFF(recordDate, prev_recordDate) = 1;

## Problem 10

*[(1661. Average Time of Process per Machine)](https://leetcode.com/problems/average-time-of-process-per-machine/)*

### Problem statement

Table: `Activity`

| Column Name   | Type   |
|---------------|--------|
| machine_id    | int    |
| process_id    | int    |
| activity_type | enum   |
| timestamp     | float  |

The table shows the user activities for a factory website. `(machine_id, process_id, activity_type)` is the primary key (combination of columns with unique values) of this table.   
`machine_id` is the ID of a machine.  
`process_id` is the ID of a process running on the machine with ID `machine_id`.  
`activity_type` is an ENUM (category) of type ('start', 'end'). 'start' means the machine starts the process at the given timestamp and 'end' means the machine ends the process at the given timestamp. The 'start' timestamp will always be before the 'end' timestamp for every (`machine_id`, `process_id`) pair.  
`timestamp` is a float representing the current time in seconds.

There is a factory website that has several machines each running the **same number of processes**. Write a solution to **find the average time each machine takes to complete a process.**

The time to complete a process is the 'end' timestamp minus the 'start' timestamp. The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.

The resulting table should have the `machine_id` along with the average time as `processing_time`, which should be **rounded to 3 decimal places.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**  
`Activity` table:
| machine_id | process_id | activity_type | timestamp |
|------------|------------|---------------|-----------|
| 0          | 0          | start         | 0.712     |
| 0          | 0          | end           | 1.520     |
| 0          | 1          | start         | 3.140     |
| 0          | 1          | end           | 4.120     |
| 1          | 0          | start         | 0.550     |
| 1          | 0          | end           | 1.550     |
| 1          | 1          | start         | 0.430     |
| 1          | 1          | end           | 1.420     |
| 2          | 0          | start         | 4.100     |
| 2          | 0          | end           | 4.512     |
| 2          | 1          | start         | 2.500     |
| 2          | 1          | end           | 5.000     |

**Output:**  
| machine_id | processing_time |
|------------|-----------------|
| 0          | 0.894           |
| 1          | 0.995           |
| 2          | 1.456           |

**Explanation:**  
There are 3 machines running 2 processes each. 
- Machine 0's average time is ((1.520 - 0.712) + (4.120 - 3.140)) / 2 = 0.894
- Machine 1's average time is ((1.550 - 0.550) + (1.420 - 0.430)) / 2 = 0.995
- Machine 2's average time is ((4.512 - 4.100) + (5.000 - 2.500)) / 2 = 1.456

### Solution

**Idea**: Using CTE, we create seperate start and end time table. Then, we joins these tables based on the machine and process IDs. After joining, we calculates the processing time for each process. Finally, we calculate averages of these processing times for each machine.

In [ ]:
WITH startset AS(
    SELECT machine_id, process_id, activity_type, timestamp
    FROM Activity
    WHERE activity_type = "start"
),
endset AS(
    SELECT machine_id, process_id, activity_type, timestamp
    FROM Activity
    WHERE activity_type = "end"
)

SELECT startset.machine_id, ROUND(AVG(endset.timestamp - startset.timestamp),3) as processing_time
FROM startset
LEFT JOIN endset
ON startset.machine_id = endset.machine_id
AND startset.process_id = endset.process_id
GROUP BY machine_id;

## Problem 11

[577. Employee Bonus](https://leetcode.com/problems/employee-bonus/)

### Problem statement

Table: `Employee`

| Column Name | Type    |
|-------------|---------|
| empId       | int     |
| name        | varchar |
| supervisor  | int     |
| salary      | int     |

`empId` is the column with unique values for this table.  
Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.

Table: `Bonus`

| Column Name | Type |
|-------------|------|
| empId       | int  |
| bonus       | int  |

`empId` is the column of unique values for this table.  
`empId` is a foreign key (reference column) to empId from the Employee table.  
Each row of this table contains the id of an employee and their respective bonus.

Write a solution to **report the name and bonus amount of each employee with a bonus less than 1000.**  
Return the result table in **any order.**

**Example:**

**Input:**  

`Employee` table:
| empId | name   | supervisor | salary |
|-------|--------|------------|--------|
| 3     | Brad   | null       | 4000   |
| 1     | John   | 3          | 1000   |
| 2     | Dan    | 3          | 2000   |
| 4     | Thomas | 3          | 4000   |

`Bonus` table:
| empId | bonus |
|-------|-------|
| 2     | 500   |
| 4     | 2000  |

**Output:** 
| name  | bonus |
|-------|-------|
| Brad  | null  |
| John  | null  |
| Dan   | 500   |

### Solution

**Idea**: Using subquery, we first create a join from two tables, then filter using WHERE, with the null included.

In [ ]:
SELECT name, bonus
FROM (
  SELECT e.name, b.bonus
  FROM Employee e
  LEFT JOIN bonus b ON e.empId = b.empId
) AS subquery
WHERE bonus < 1000 or bonus is null;

## Problem 12

*[(1280. Students and Examinations)](https://leetcode.com/problems/students-and-examinations/)*

### Problem statement

Table: `Students`

| Column Name   | Type    |
|---------------|---------|
| student_id    | int     |
| student_name  | varchar |

`student_id` is the primary key (column with unique values) for this table.  
Each row of this table contains the ID and the name of one student in the school.

Table: `Subjects`
| Column Name   | Type    |
|---------------|---------|
| subject_name  | varchar |

`subject_name` is the primary key (column with unique values) for this table.  
Each row of this table contains the name of one subject in the school.

Table: `Examinations`

| Column Name   | Type    |
|---------------|---------|
| student_id    | int     |
| subject_name  | varchar |

There is no primary key (column with unique values) for this table. It may contain duplicates.  
Each student from the Students table takes every course from the Subjects table.  
Each row of this table indicates that a student with ID student_id attended the exam of subject_name.  

Write a solution to **find the number of times each student attended each exam.**

Return the result table **ordered by** `student_id` **and** `subject_name`.

The result format is in the following example.

**Example 1:**

**Input:**  

`Students` table:
| student_id | student_name |
|------------|--------------|
| 1          | Alice        |
| 2          | Bob          |
| 13         | John         |
| 6          | Alex         |

`Subjects` table:
| subject_name |
|--------------|
| Math         |
| Physics      |
| Programming  |

`Examinations` table:
| student_id | subject_name |
|------------|--------------|
| 1          | Math         |
| 1          | Physics      |
| 1          | Programming  |
| 2          | Programming  |
| 1          | Physics      |
| 1          | Math         |
| 13         | Math         |
| 13         | Programming  |
| 13         | Physics      |
| 2          | Math         |
| 1          | Math         |

**Output:** 
| student_id | student_name | subject_name | attended_exams |
|------------|--------------|--------------|----------------|
| 1          | Alice        | Math         | 3              |
| 1          | Alice        | Physics      | 2              |
| 1          | Alice        | Programming  | 1              |
| 2          | Bob          | Math         | 1              |
| 2          | Bob          | Physics      | 0              |
| 2          | Bob          | Programming  | 1              |
| 6          | Alex         | Math         | 0              |
| 6          | Alex         | Physics      | 0              |
| 6          | Alex         | Programming  | 0              |
| 13         | John         | Math         | 1              |
| 13         | John         | Physics      | 1              |
| 13         | John         | Programming  | 1              |

**Explanation:** 
The result table should contain all students and all subjects.  
- Alice attended the Math exam 3 times, the Physics exam 2 times, and the Programming exam 1 time.
- Bob attended the Math exam 1 time, the Programming exam 1 time, and did not attend the Physics exam.
- Alex did not attend any exams.
- John attended the Math exam 1 time, the Physics exam 1 time, and the Programming exam 1 time.

### Solution

**Idea**: 
- Using CTE, we count attended exams for each student, on each subject.
- Perform CROSS JOIN on `Students` table to ensure that all combinations of students and subjects are included in the result, using IFNULL to fill NA by 0.
- Afterward, LEFT JOIN with our CTE, again by student-subject pair.
- Order the result as specified.

In [ ]:
WITH attended_count AS (
    SELECT student_id, subject_name, COUNT(*) AS attended_exams
    FROM Examinations
    GROUP BY student_id, subject_name
)

SELECT Students.student_id, Students.student_name, Subjects.subject_name, IFNULL(attended_count.attended_exams, 0) AS attended_exams
FROM Students
CROSS JOIN Subjects
LEFT JOIN attended_count
    ON Students.student_id = attended_count.student_id
    AND Subjects.subject_name = attended_count.subject_name
ORDER BY student_id, subject_name;

## Problem 13

*[(570. Managers with at Least 5 Direct Reports)](https://leetcode.com/problems/managers-with-at-least-5-direct-reports/)*

### Problem statement

Table: `Employee`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| department  | varchar |
| managerId   | int     |

`id` is the primary key (column with unique values) for this table.  
Each row of this table indicates the name of an employee, their department, and the id of their manager.  
If `managerId` is null, then the employee does not have a manager.  
No employee will be the manager of themself.

Write a solution to find **managers with at least five direct reports.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Employee` table:
| id  | name  | department | managerId |
|-----|-------|------------|-----------|
| 101 | John  | A          | null      |
| 102 | Dan   | A          | 101       |
| 103 | James | A          | 101       |
| 104 | Amy   | A          | 101       |
| 105 | Anne  | A          | 101       |
| 106 | Ron   | B          | 101       |

**Output:**
| name |
|------|
| John |

### Solution

**Idea**: We use subquery to find manager with at least 5 direct reports, using HAVING condition (as WHERE doesn't work after GROUP BY). Then, use JOIN to take out only those managers' names.

In [ ]:
SELECT e.name
FROM Employee e
JOIN (
    SELECT managerId, COUNT(managerId) AS num_reports
    FROM Employee
    GROUP BY managerId
    HAVING COUNT(managerId) >= 5
) reports_count ON e.id = reports_count.managerId;

## Problem 14

*[(1934. Confirmation Rate)](https://leetcode.com/problems/confirmation-rate/)*

### Problem statement

Table: `Signups`

| Column Name | Type     |
|-------------|----------|
| user_id     | int      |
| time_stamp  | datetime |

`user_id` is the column of unique values for this table.  
Each row contains information about the signup time for the user with ID user_id.

Table: `Confirmations`

| Column Name | Type     |
|-------------|----------|
| user_id     | int      |
| time_stamp  | datetime |
| action      | ENUM     |

`(user_id, time_stamp)` is the primary key (combination of columns with unique values) for this table.  
`user_id` is a foreign key (reference column) to the `Signups` table.  
`action` is an ENUM (category) of the type ('confirmed', 'timeout').  
Each row of this table indicates that the user with ID `user_id` requested a confirmation message at time_stamp and that confirmation message was either confirmed ('confirmed') or expired without confirming ('timeout').

The confirmation rate of a user is the number of 'confirmed' messages divided by the total number of requested confirmation messages. The confirmation rate of a user that did not request any confirmation messages is 0. Round the confirmation rate to **two decimal places.**

Write a solution to **find the confirmation rate of each user.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**  

`Signups` table:
| user_id | time_stamp          |
|---------|---------------------|
| 3       | 2020-03-21 10:16:13 |
| 7       | 2020-01-04 13:57:59 |
| 2       | 2020-07-29 23:09:44 |
| 6       | 2020-12-09 10:39:37 |

`Confirmations` table:
| user_id | time_stamp          | action    |
|---------|---------------------|-----------|
| 3       | 2021-01-06 03:30:46 | timeout   |
| 3       | 2021-07-14 14:00:00 | timeout   |
| 7       | 2021-06-12 11:57:29 | confirmed |
| 7       | 2021-06-13 12:58:28 | confirmed |
| 7       | 2021-06-14 13:59:27 | confirmed |
| 2       | 2021-01-22 00:00:00 | confirmed |
| 2       | 2021-02-28 23:59:59 | timeout   |

**Output:**  
| user_id | confirmation_rate |
|---------|-------------------|
| 6       | 0.00              |
| 3       | 0.00              |
| 7       | 1.00              |
| 2       | 0.50              |

**Explanation:**  
- User 6 did not request any confirmation messages. The confirmation rate is 0.
- User 3 made 2 requests and both timed out. The confirmation rate is 0.
- User 7 made 3 requests and all were confirmed. The confirmation rate is 1.
- User 2 made 2 requests where one was confirmed and the other timed out. The confirmation rate is 1 / 2 = 0.5.

### Solution

In [ ]:
SELECT 
    Signups.user_id,
    IFNULL(ROUND(SUM(Confirmations.action = 'confirmed') / COUNT(Confirmations.action), 2), 0) AS confirmation_rate 
FROM Signups
LEFT JOIN Confirmations ON Signups.user_id = Confirmations.user_id
GROUP BY Signups.user_id;

---

In [ ]:
SECTION 3: BASIC AGGREGATIONS